{
  "heading_url": "https://maps.app.goo.gl/QiZbAipketzEabZZ9",
  "items": [
    {
      "date": "2026-01-29",
      "image": "/images/reviews/2026-01-29.1.jpg",
      "source":"google",
      "name": "Pavol Porubsky",
      "rating": 5,
      "text": "Really Good tailor in Phuket hightly recommed",
      "url": "https://maps.app.goo.gl/CeaCAPbtcD6We1NY9"
    },
    {
      "date": "2026-01-29",
      "image": "/images/reviews/2026-01-29.2.jpg",
      "source":"google",
      "name": "Simon Wichmann",
      "rating": 5,
      "text": "I recommend No. 1 Armani suits to everyone in Patong, Phuket!<br/>\nThe owner is very nice, and knows his work.<br/>\nAnd he has a good employee who is so friendly and Scandinavia speaking😄<br/>\n<br/>\nThe suit I got was perfectly fitted, nice material and very good price also.<br/>\nI will come back to this place 😁?",
      "url": "https://maps.app.goo.gl/BPxnR3fJUahCcVLbA"
    },
    {
      "date": "2026-01-28",
      "image": "/images/reviews/2026-01-28.1.jpg",
      "source":"google",
      "name": "Jordan Grant",
      "rating": 5,
      "text": "Amazing service and a perfect suit! It was made within 4 days and ready to take home by day 5!!\n<br/>\nWe showed the team 1-2 photos from Pinterest and made some notes about what we liked/specific aspects of the design and it was tailored exactly as we asked!\n<br/>\nThey had excellent recommendations on colours and fabrics to fit my style and were more than happy for me to test as many colours as I needed to make the right choice.\n<br/>\nWould recommend seeking out No 1 Armani Suits if you're looking for a custom tailored suit in Patong.",
      "url": "https://maps.app.goo.gl/U8PNqzTUJ3n88uoDA"
    },
    {
      "date": "2026-01-28",
      "image": "/images/reviews/2026-01-28.2.jpg",
      "source":"google",
      "name": "Sam",
      "rating": 5,
      "text": "This is a wonderful suit and very well made. Reasonably priced too. <br/>\nI showed 1 picture from Pinterest and it is just about identical with the additions that I wanted. \n<br/>There were many colours to choose from but the red stood out to me and I absolutely love it! It is light weight and breezy which is perfect for Australia all year round (my home country). \n<br/>I would recommend this shop to anyone looking for a good quality, custom suit. And likely any other piece of clothing too.",
      "url": "https://maps.app.goo.gl/Ho91rCYY4GbPpJPH6"
    },
    {
      "date": "2026-01-26",
      "image": "/images/reviews/2026-01-26.1.jpg",
      "source":"google",
      "reviewer": "Nemo Sylvander",
      "rating": 5,
      "text": "",
      "url": "https://maps.app.goo.gl/TR8xTQhbVyCPF9Pc6"
    },
    {
      "date": "2026-01-25",
      "image": "/images/reviews/2026-01-25.1.jpg",
      "source":"google",
      "name": "ole Nicolai Myrvold Jørgensen",
      "rating": 5,
      "text": "They are really good at suits and good fashion for guys!\n<br/>\nThey are all kind. They don't push you at all. They let you spend a lot of time thinking about what you want and how much you want to buy.\n<br/>\nI bought 1 suit with 5 different shirts.\n<br/>\nI get jewelry and other goodies for the suit included in the purchase.\n<br/>\nI really recommend shopping here.\n<br/>\nFor those of you from Norway, the manager is Norwegian-speaking. He speaks fluent Norwegian and makes shopping much easier.",
      "url": "https://maps.app.goo.gl/U4wN2Vjkyhn5NbBT7"
    },
    {
      "date": "2026-01-09",
      "image": "/images/reviews/2026-01-09.jpg",
      "source":"google",
      "name": "Trevor Levin",
      "rating": 5,
      "text": "Great pricing and amazing service. The employees are so nice and it was fun to have many conversations with them. The suits look great and fit perfectly. They payed attention to all details and worked hard to make alterations so everything was perfect.\n<br/>\nAfter talking to many stores around the area this place was by far the best with pricing and honest people.",
      "url": "https://maps.app.goo.gl/QiZbAipketzEabZZ9"
    }
  ]
}
